---
title: Notes | Cisco
author: Zeropio
date: 2022-12-30
categories: [Notes, blueteam]
tags: [network]
permalink: /notes/blueteam/cisco
---

# Basic IOS

## Indicators 

EXEC mode user:
```console
Switch>
Router>
```

EXEC mode privileged:
```console
Switch#
Router#
```

Global configuration:
```console
Switch(config)#
Router(config)#
```

Other configuration:
```console
Switch(config-)#
Router(config-)#
```

To move from a mode to another:

![](/assets/img/notes/blue-team/cisco-modes.png)

We have indicators:

| **Indicator** | **Mode** |
| ------------- | -------- |
| `Router>` | User Exec |
| `Router#` | Privileged Exec |
| `Router(config)` | Global configuration |
| `Router(config-if)` | Interface configuration |
| `Router(config-router)` | Routing configuration |
| `rommon 1>` | ROM monitor |

## Show

We have some `show` commands:
```console
Router# show version
Router# show processes CPU
Router# show protocols
Router# show running-config
Router# show memory
Router# show stacks
Router# show buffers
Router# show startup-config
Router# show flash
Router# show interface
```

## Hostname

The hostname can be changed:
```console
Router>enable
Router# configure terminal
Router(config)# hostname R1
R1(config)#
```

## Interfaces 

To configure an interface:
```console
Router(config)# interface FastEthernet 0/0
Router(config­if)# ip address 192.168.1.15 255.255.255.0
Router(config­if)# no shutdown
Router(config­if)# ^Z
Router#
```

A description can also be added:
```console
`router(config­if)#description this is a description
```

## Password
To add a enable password:
```console
Router(config)# enable password <PASS>
```

To add a enable secret password:
```console
Router(config)# enable secret <PASS>
```

To add a console password:
```console
Router(config)# line console 0
Router(config­line)# password <PASS>
Router(config­line)# login
```

To add a VTY password:
```console
Router(config)# line vty 0 4
Router(config­line)# password <PASS>
Router(config­line)# login
```

## Banner
We can add a banner with:
```console
Router(config)# banner motd # This is a banner message #
```

## Save 

To save the config we need to run:
```console
Router# write
```

To delete we have two ways:
```console
Router# erase startup­config
Router# write erase
```

---

# Routing

## Static

To add an entry `ip route n.n.n.n m.m.m.m g.g.g.g`:
```console
Router(config)# ip route 78.4.0.0 255.255.0.0 138.4.3.1
Router(config)# ^Z
Router#
```

To delete it:
```console
Router(config)# no ip route 78.4.0.0 255.255.0.0 138.4.3.1
```

## RIP
To configure RIP:
```console
Router1# configure terminal
Router1(config)# router rip
Router1(config-router)# network 10.0.0.0
Router1(config-router)# network 172.16.0.0 
```

To the other router:
```console
Router2# config terminal
Router2(config)# router rip
Router2(config-router)# network 10.0.0.0 
```

And the last router:
```console
Router4# config terminal
Router4(config)# router rip
Router4(config-router)# network 172.16.0.0 
```

To check the routing table and protocol:
```console
Router4#show ip route
Router4#show ip protocol
```

---

# VLAN

In the VTP mode, configure two switches:
```console
Switch3#conf t
Switch3(config)#interface vlan1
Switch3(config-if)#ip address 10.1.1.1 255.255.255.0
Switch3(config-if)#no shutdown
Switch3(config-if)#end
```

```console
Switch4#conf t
Switch4(config)#interface vlan1
Switch4(config-if)#ip address 10.1.1.2 255.255.255.0
Switch4(config-if)#no shutdown
Switch4(config-if)#end
```

Add VLAN 8 and VLAN 14 to Switch3, assigning ports 2-5 to VLAN 8 and ports 6-10 to VLAN 14:
```console
Switch3#vlan database
Switch3(vlan)#vlan 8
Switch3(vlan)#vlan 14
Switch3(vlan)#exit
Switch3#conf t
Switch3(config)#interface range fast0/2 – 5
Switch3(config-range)#switchport access vlan 8
Switch3(config-range)#exit
Switch3(config)#interface range fast 0/6 – 10
Switch3(config-range)#switchport access vlan 14
Switch3(config-range)#exit
Switch3(config)#exit
```

The names can also be changed:
```console
Switch3(config)# vlan 8
Switch3(config-vlan)# name Student
Switch3(config-vlan)# vlan 14
Switch3(config-vlan)# name Faculty
```

We can see everything with `Switch3#show vlan`. We can configure now Switch3 to a VTP server and Switch4 to a VTP client:
```console
Switch3#vlan database
Switch3(vlan)#vtp server
Switch3(vlan)#vtp domain Boson
Switch3(vlan)#vtp password rules
Switch3(vlan)#exit
```

```console
Switch4#vlan database
Switch4(vlan)#vtp client
Switch4(vlan)#vtp domain Boson
Switch4(vlan)#vtp password rules
Switch4(vlan)#exit
```

Now create the trunk:
```console
Switch3# conf t
Switch3(config)#interface fast 0/12
Switch3(config-if)#switchport mode trunk
Switch3(config-if)#end
```

```console
Switch4#conf t
Switch4(config)#interface fast 0/12
Switch4(config-if)#switchport mode trunk
Switch4(config-if)#end
```

Now check the status:
```console
Switch4# show vlan
Switch4# show vtp status
```

---

# STP
To configure **spanning tree**:
```console
S1(config)# vlan 10
S1(config-vlan)# name User
S1(config-vlan)# vlan 99
S1(config-vlan)# name Management
S1(config-vlan)# exit
S1(config)# interface f0/6
S1(config-if)# no shutdown
S1(config-if)# switchport mode access
S1(config-if)# switchport access vlan 10
S1(config-if)# interface f0/1
S1(config-if)# no shutdown
S1(config-if)# switchport mode trunk
S1(config-if)# switchport trunk native vlan 99
S1(config-if)# interface f0/3
S1(config-if)# no shutdown
S1(config-if)# switchport mode trunk
S1(config-if)# switchport trunk native vlan 99
S1(config-if)# interface vlan 99
S1(config-if)# ip address 192.168.1.11 255.255.255.0
S1(config-if)# exit
S1(config)# spanning-tree vlan 1,10,99 root secondary
S1(config)# spanning-tree mode rapid-pvst
S1(config)# interface f0/6
S1(config-if)# spanning-tree portfast
S1(config-if)# spanning-tree bpduguard enable
```

```console
S2(config)# vlan 10
S2(config-vlan)# name User
S2(config-vlan)# vlan 99
S2(config-vlan)# name Management
S2(config-vlan)# exit
S2(config)# interface f0/1
S2(config-if)# no shutdown
S2(config-if)# switchport mode trunk
S2(config-if)# switchport trunk native vlan 99
S2(config-if)# interface f0/3
S2(config-if)# no shutdown
S2(config-if)# switchport mode trunk
S2(config-if)# switchport trunk native vlan 99
S2(config-if)# interface vlan 99
S2(config-if)# ip address 192.168.1.12 255.255.255.0
S2(config-if)# exit
S2(config)# spanning-tree vlan 1,10,99 root primary
S2(config)# spanning-tree mode rapid-pvst
```

```console
S3(config)# vlan 10
S3(config-vlan)# name User
S3(config-vlan)# vlan 99
S3(config-vlan)# name Management
S3(config-vlan)# exit
S3(config)# interface f0/18
S3(config-if)# no shutdown
S3(config-if)# switchport mode access
S3(config-if)# switchport access vlan 10
S3(config-if)# spanning-tree portfast
S3(config-if)# spanning-tree bpduguard enable
S3(config-if)# interface f0/1
S3(config-if)# no shutdown
S3(config-if)# switchport mode trunk
S3(config-if)# switchport trunk native vlan 99
S3(config-if)# interface f0/3
S3(config-if)# no shutdown
S3(config-if)# switchport mode trunk
S3(config-if)# switchport trunk native vlan 99
S3(config-if)# interface vlan 99
S3(config-if)# ip address 192.168.1.13 255.255.255.0
S3(config-if)# exit
S3(config)# spanning-tree mode rapid-pvst
```

---

# Ethernet Channel
To configure it:
```console
S1#configure terminal
S1(config)# interface range fastethernet0/13 -14
S1(config-if-range)# switchport mode trunk
S1(config-if-range)# switchport access vlan 10
S1(config-if-range)# channel-group 1 mode on
S1(config-if-range)# exit
S1(config)# exit
S1# write
```

```console
S3# configure terminal
S3(config)# interface range fastethernet0/13 -14
S3(config-if-range)# switchport mode trunk
S3(config-if-range)# switchport access vlan 10
S3(config-if-range)# channel-group 1 mode on
S3(config-if-range)# exit
S3(config)# exit
S3# write
```

Check the status:
```console
S1#show interfaces status
S1#show etherchannel detail
S1#show etherchannel summary
```

---

# DHCP
Configure router as DHCP server:
```console
Router(config)# ip dhcp pool clases
Router(dhcp­config)# network 192.168.1.0 255.255.255.0
```

To exclude:
```console
Router(config)# ip dhcp excluded­address 192.168.1.1 192.168.1.10
Router(config)# ip dhcp excluded­address 192.168.1.12
```

A full configuration could be:
```console
Router(config)# ip dhcp pool clases
Router(dhcp­config)# network 192.168.1.0 255.255.255.0 
Router(dhcp­config)# default­router 192.168.1.1 
Router(dhcp­config)# dns­server 192.168.1.2
Router(dhcp­config)# domain­name zeropio.com
```

Start the service:
```console
Router(config)# no service dhcp
Router(config)# service dhcp
```

Check:
```console
Router# show ip dhcp binding
Router# debug ip dhcp server events
```

The full commands avaible:

| **Command** | **Description** |
| ----------- | --------------- |
| `network <IP> [mask | /prefix]` | Set IP and mask |
| `default-router <IP>` | Set gateway |
| `dns-server <IP> [<IP2>... <IP8>]` | DNS servers |
| `domain-name <DOMAIN>` | Set domain name |
| `lease {<DAYS> [HOURS] [MINUTES] infinite}` | Set duration |

## Snooping
First, configure two switches:
```console
Switch2# ena
Switch2#configure terminal
Switch2(config)#vlan 10
Switch2(config-vlan)#name VLAN10
Switch2(config-vlan)#exit
Switch2(config)#interface range fastEthernet 0/1-24
Switch2(config-if-range)#switchport mode access
Switch2(config-if-range)#switchport access vlan 10
Switch2(config-if-range)#exit
Switch2(config)#interface gigabitEthernet 0/1
Switch2(config-if)#switchport mode trunk
Switch2(config-if)#exit
```

```console
Switch1# ena
Switch1#configure terminal
Switch1(config)#vlan 10
Switch1(config-vlan)#name VLAN10
Switch1(config-vlan)#exit
Switch1(config)#interface range fastEthernet 0/1-24
Switch1(config-if-range)#switchport mode access
Switch1(config-if-range)#switchport access vlan 10
Switch1(config-if-range)#exit
Switch1(config)#interface gigabitEthernet 0/1
Switch1(config-if)#switchport mode trunk
Switch1(config-if)#exit
```

Then configure DHCP Snooping:
```console
Switch2#configure terminal
Switch2(config)#ip dhcp snooping
Switch2(config)#ip dhcp snooping vlan 10
Switch2(config)#ip dhcp snooping information option allow-untrusted
Switch2(config)#ip dhcp snooping database flash:dhcp_snooping.db
Switch2(config)#ip dhcp snooping database write-delay 30
Switch2(config)#interface fastEthernet 0/13
Switch2(config-if)#ip dhcp snooping trust
Switch2(config-if)#exit
```

```console
Switch1#configure terminal
Switch1(config)#ip dhcp snooping
Switch1(config)#ip dhcp snooping vlan 10
Switch1(config)#ip dhcp snooping information option allow-untrusted
Switch1(config)#ip dhcp snooping database flash:dhcp_snooping.db
Switch1(config)#ip dhcp snooping database write-delay 30
Switch1(config)#interface gigabitEthernet 0/1
Switch1(config-if)#ip dhcp snooping trust
Switch1(config-if)#exit
```

For show:
```console
Switch#show ip dhcp snooping
```

---

# ACLs
There are a few rules:
- ACLs are read in order.
- There can't be two ACLs in the same interface and protocol.
- A set of ACLs can be assigned to different interfaces.

ACLs are configured as:
```console
router(config)# access-list ZZ permit|any X.X.X.X Y.Y.Y.Y
```

Then, add the ACL group to the interface:
```console
Router(config-if)# ip access-group XX in|out
```

Or to telnet ports:
```console
Router(config)# line vty 0 4
Router(config-line)# access-class XX in|out
```

For example:
```console
Router(config)# access-list 1 permit 192.168.1.0 0.0.0.255
Router(config)# access-list 1 deny any *
Router(config)# interface serial0
Router(config-if)# ip access-group 1 out
```

## Extended ACLs 
These ACLs are numbered between 100 and 199:
```console
Router(config)# access-list 100 deny ip 192.168.1.32 0.0.0.0 172.16.2.0 0.0.0.255
Router(config)# access-list 100 permit ip any any
...
Router(config-if)# access-group 100 out
```

```console
Router(config)# access-list 101 deny tcp 192.168.14.0 0.0.0.255 any eq 80
Router(config)# access-list 101 permit ip any any
```

Extended ACLs can have name:
```console
Router(config)# ip access-list standar blocked
Router(config-std-nacl)# deny 192.168.14.0 0.0.0.255
Router(config-std-nacl)# permit any
```

---

# NAT

## Static 
Start with this command:
```console
Router(config)# ip nat inside source static <IP INTERNAL> <IP EXTERNAL>
```

Define in and out interfaces:
```console
Router(config)# interface <INTERFACE>
Router(config-if)# ip address <IP INTERFACE> <MASK>
Router(config-if)# ip nat inside
Router(config-if)# no shutdown
Router(config-if)# exit
Router(config)# interface <INTERFACE>
Router(config-if)# ip address <IP INTERFACE> <MASK>
Router(config-if)# ip nat outside
Router(config-if)# no shutdown
Router(config-if)# exit
```

## Dynamic 
First create a IP pool and an ACL. Then link both of them:
```console
Router(config)# ip nat pool <NAME> <FIRST IP> <LAST IP> <NETMASK>
Router(config)# access-list 1 permit <ALLOW INTERNAL IP> <WILDCARD>
Router(config)# ip nat inside source list 1 pool <POOL NAME>
```

Define in and out interfaces:
```console
Router(config)# interface <INTERFACE>
Router(config-if)# ip address <IP INTERFACE> <MASK>
Router(config-if)# ip nat inside
Router(config-if)# no shutdown
Router(config-if)# exit
Router(config)# interface <INTERFACE>
Router(config-if)# ip address <IP INTERFACE> <MASK>
Router(config-if)# ip nat outside
Router(config-if)# no shutdown
Router(config-if)# exit
```

## PAT
Create an ACL and link to `overload`:
```console
Router(config)# access-list 1 permit <IP PERMITTED> <WILDCARD>
Router(config)# ip nat inside source list 1 interface <TYPE> <NUMBER> overload
```

Define in and out interfaces:
```console
Router(config)# interface <INTERFACE>
Router(config-if)# ip address <IP INTERFACE> <MASK>
Router(config-if)# ip nat inside
Router(config-if)# no shutdown
Router(config-if)# exit
Router(config)# interface <INTERFACE>
Router(config-if)# ip address <IP INTERFACE> <MASK>
Router(config-if)# ip nat outside
Router(config-if)# no shutdown
Router(config-if)# exit
```

---

# SSH
Change the hostname, it is necessary for SSH:
```console
Router(config)# hostname RouterA
RouterA(config)#ip domain-name zeropio.com
RouterA(config)#crypto key generate rsa 1024
RouterA(config)#ip ssh time-out 30
RouterA(config)#ip ssh authentication-retries 3
RouterA(config)#ip ssh version 2
RouterA(config)#username <USER> privilege 15 password <PASS>
RouterA(config)#line vty 0 4
RouterA(config-line)#transport input ssh
RouterA(config-line)#login local
```


